In [37]:
import pandas as pd

In [38]:
urlDataSet='https://github.com/berislav-vidakovic/PythonBlog/raw/main/sample_pivot.xlsx'

In [39]:
df=pd.read_excel(urlDataSet)

In [40]:
df.head()

        Date Region                 Type  Units  Sales
0 2020-07-11   East  Children's Clothing   18.0    306
1 2020-09-23  North  Children's Clothing   14.0    448
2 2020-04-02  South     Women's Clothing   17.0    425
3 2020-02-28   East  Children's Clothing   26.0    832
4 2020-03-19   West     Women's Clothing    3.0     33

In [29]:
import sys
print(sys.version)

3.11.4 | packaged by Anaconda, Inc. | (main, Jul  5 2023, 13:38:37) [MSC v.1916 64 bit (AMD64)]

In [30]:
pivot1=pd.pivot_table(df, index='Region')
pivot1

C:\Users\User\AppData\Local\Temp\ipykernel_26296\3601309144.py:1: FutureWarning: pivot_table dropped a column because it failed to aggregate. This behavior is deprecated and will raise in a future version of pandas. Select only the columns that can be aggregated.
  pivot1=pd.pivot_table(df, index='Region')

             Sales      Units
Region
East    408.182482  19.732360
North   438.924051  19.202643
South   432.956204  20.423358
West    452.029412  19.294118

In [31]:
pivot1=pd.pivot_table(df, index='Region', values=['Sales','Units'])
pivot1

             Sales      Units
Region
East    408.182482  19.732360
North   438.924051  19.202643
South   432.956204  20.423358
West    452.029412  19.294118

In [33]:
pivot2=pd.pivot_table(df, index='Region', values='Units', aggfunc='sum')
pivot2

         Units
Region
East    8110.0
North   4359.0
South   2798.0
West    2624.0

In [36]:
pivot3=pd.pivot_table(df, index='Region', 
                      values=['Units','Sales'], aggfunc=['sum','mean'])
pivot3

           sum                mean
         Sales   Units       Sales      Units
Region
East    167763  8110.0  408.182482  19.732360
North   138700  4359.0  438.924051  19.202643
South    59315  2798.0  432.956204  20.423358
West     61476  2624.0  452.029412  19.294118

pivot4=pd.pivot_table(df, index='Region', 
                     columns='Type', values='Units', fill_value=0)
pivot4

In [44]:
pivot5=pd.pivot_table(df, index='Region', columns='Type',
    values='Sales', aggfunc='sum', margins=True, margins_name='Total')
pivot5

Type    Children's Clothing  Men's Clothing  Women's Clothing   Total
Region
East                  45849           51685             70229  167763
North                 37306           39975             61419  138700
South                 18570           18542             22203   59315
West                  20182           19077             22217   61476
Total                121907          129279            176068  427254